fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительныйОтпуск</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодсчитатьКоличествоДнейОтпуска();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)  
	
	ПодсчитатьКоличествоДнейОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПодсчитатьКоличествоДнейОтпуска();
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ДанныеСтрокиДокумента = ПоместитьВХранилище();
	//ПоместитьВХранилище();
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ДанныеСтрокиДокумента, ЭтотОбъект);
	//ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодсчитатьКоличествоДнейОтпуска()
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		ДанныеСтрокиСотрудники = Новый Структура();
		ДанныеСтрокиСотрудники.Вставить("Сотрудник", Строка.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ДанныеСтрокиСотрудники);
		
		ДнейОтпуска = 0;
		
		Для Каждого Стр ИЗ НайденныеСтроки Цикл
			
			КоличествоДней = (Стр.ДатаОкончания - Стр.ДатаНачала) / 86400 +1;
			ДнейОтпуска = ДнейОтпуска + КоличествоДней; 
			Стр.КоличествоДнейОтпуска = ДнейОтпуска;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилище()
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	//ТаблицаОтпусков.Свернуть("Сотрудник, ДатаНачала, ДатаОкончания",);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаОтпусков, УникальныйИдентификатор);
	//АдресВХранилище = Новый ХранилищеЗначения(ТаблицаОтпусков);
	
	ДанныеСтрокиДокумента = Новый Структура();
	ДанныеСтрокиДокумента.Вставить("АдресДанных", АдресВХранилище);
	
	Возврат ДанныеСтрокиДокумента;
	
КонецФункции 

#КонецОбласти
